app/Controllers/Dashboard.php

                'tanggal'      => date('Y-m-d H:i:s'),
                'keterangan'   => 'Tambah Barang Baru'
            ];
            $this->db->table('barang_masuk')->insert($data_masuk);
---
INSERT INTO `barang_masuk` (`id_sparepart`, `jumlah`, `tanggal`, `keterangan`) VALUES (30007, '22', '2026-05-30 08:20:09', 'Tambah Barang Baru')