app/Controllers/Login.php

    public function proses_reset()
    {
        $username        = $this->request->getPost('username');
        $password_lama   = $this->request->getPost('password_lama');
        $password_baru   = $this->request->getPost('password_baru');
        $konfirmasi_baru = $this->request->getPost('konfirmasi_baru');

        $user = $this->authModel->get_user_by_username($username);

        if ($user) {
            if (password_verify($password_lama, $user['password'])) {
                if ($password_baru === $konfirmasi_baru) {
                    $password_hash = password_hash($password_baru, PASSWORD_DEFAULT);

                    $db = \Config\Database::connect();
                    $db->table('users')->where('username', $username)->update(['password' => $password_hash]);
---
UPDATE `users` SET `password` = '$2y$10$/1plvT4MdHum5ZqRq729ZOTfl08Tvsu1Y5yVDLo15vAhsJwfuG8Ke'
WHERE `username` = 'admin'