app/Models/SparepartModel.php

    public function get_all_spareparts()
    {
        return $this->orderBy('id_sparepart', 'DESC')->findAll();
---
SELECT *
FROM `spareparts`
ORDER BY `id_sparepart` DESC

    public function insert_sparepart($data)
    {
        return $this->insert($data);
---
INSERT INTO `spareparts` (`kode_barang`, `nama_barang`, `kategori`, `harga`, `stok`, `gambar`) VALUES ('WEB-01', 'TESTING', 'Aksesoris', '120000', '22', '1780129209_be326ccad134f2de397b.jpg')

    public function get_log_masuk()
    {
        return $this->db->table('barang_masuk')
                    ->select('barang_masuk.*, spareparts.kode_barang, spareparts.nama_barang')
                    ->join('spareparts', 'spareparts.id_sparepart = barang_masuk.id_sparepart')
                    ->orderBy('tanggal', 'DESC')
                    ->get()
                    ->getResultArray();
---
SELECT `barang_masuk`.*, `spareparts`.`kode_barang`, `spareparts`.`nama_barang`
FROM `barang_masuk`
JOIN `spareparts` ON `spareparts`.`id_sparepart` = `barang_masuk`.`id_sparepart`
ORDER BY `tanggal` DESC

    public function get_log_keluar()
    {
        return $this->db->table('barang_keluar')
                    ->select('barang_keluar.*, spareparts.kode_barang, spareparts.nama_barang')
                    ->join('spareparts', 'spareparts.id_sparepart = barang_keluar.id_sparepart')
                    ->orderBy('tanggal', 'DESC')
                    ->get()
                    ->getResultArray();
---
SELECT `barang_keluar`.*, `spareparts`.`kode_barang`, `spareparts`.`nama_barang`
FROM `barang_keluar`
JOIN `spareparts` ON `spareparts`.`id_sparepart` = `barang_keluar`.`id_sparepart`
ORDER BY `tanggal` DESC

    public function get_all_pesanan()
    {
        return $this->db->table('pesanan')
                    ->orderBy('tanggal_pesan', 'DESC')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `pesanan`
ORDER BY `tanggal_pesan` DESC